Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# SetDesc_edit_paste_detectWithoutConfirmation
source: When Ctrl+V in the Hex column detects a format, paste it without opening Paste special.
ar: عندما يكتشف Ctrl+V في عمود Hex تنسيقاً، يتم اللصق دون فتح «لصق خاص».
cs: Když Ctrl+V ve sloupci Hex rozpozná formát, vložit ho bez otevření dialogu Vložit jinak.
de: Wenn Ctrl+V in der Hex-Spalte ein Format erkennt, ohne Öffnen von „Inhalte einfügen“ einfügen.
el: Όταν το Ctrl+V στη στήλη Hex εντοπίζει μια μορφή, επικόλλησή της χωρίς άνοιγμα της Ειδικής επικόλλησης.
es: Cuando Ctrl+V en la columna Hex detecta un formato, pega sin abrir Pegado especial.
fa: وقتی Ctrl+V در ستون Hex قالبی را تشخیص می‌دهد، بدون باز کردن «چسباندن ویژه» چسبانده شود.
fr: Lorsque Ctrl+V dans la colonne Hex détecte un format, coller sans ouvrir Collage spécial.
hu: Ha a Hex oszlopban a Ctrl+V felismer egy formátumot, a beillesztés az Irányított beillesztés ablak megnyitása nélkül történik.
id: Saat Ctrl+V di kolom Hex mendeteksi suatu format, tempel tanpa membuka Tempel khusus.
it: Quando Ctrl+V nella colonna Hex rileva un formato, incollalo senza aprire Incolla speciale.
ja: Hex 列での Ctrl+V で形式を判別したとき、形式を選択して貼り付けを開かずに貼り付ける。
ko: Hex 열에서 Ctrl+V로 형식이 감지되면 [선택하여 붙여넣기]를 열지 않고 붙여넣습니다.
pl: Gdy Ctrl+V w kolumnie Hex wykryje format, wkleja go bez otwierania okna Wklej specjalnie.
pt: Quando Ctrl+V na coluna Hex detecta um formato, cola-o sem abrir Colar especial.
ro: Când Ctrl+V în coloana Hex detectează un format, îl lipește fără a deschide Lipire specială.
ru: Если при нажатии Ctrl+V в столбце Hex распознан формат, вставлять его без открытия окна «Специальная вставка».
th: เมื่อ Ctrl+V ในคอลัมน์ Hex ตรวจพบรูปแบบ ให้วางทันทีโดยไม่เปิดวางแบบพิเศษ
tr: Hex sütununda Ctrl+V bir biçim algıladığında, Özel yapıştır'ı açmadan yapıştırır.
uk: Якщо Ctrl+V у стовпці Hex розпізнає формат, вставляти його без відкриття вікна «Спеціальне вставлення».
vi: Khi Ctrl+V trong cột Hex phát hiện được định dạng, dán luôn mà không mở Dán đặc biệt.
zh_hans: 在 Hex 列中按 Ctrl+V 检测到格式时，不打开“选择性粘贴”而直接粘贴。
zh_hant: 在 Hex 欄按 Ctrl+V 偵測到格式時，不開啟「選擇性貼上」而直接貼上。

# Menu_Search_Replace.Text
source: Replace...
ar: استبدال...
cs: Nahradit...
de: Ersetzen...
el: Αντικατάσταση...
es: Reemplazar...
fa: جایگزینی...
fr: Remplacer...
hu: Csere...
id: Ganti...
it: Sostituisci...
ja: 置換(H)...
ko: 바꾸기(H)...
pl: Zamień...
pt: Substituir...
ro: Înlocuire...
ru: Заменить...
th: แทนที่(H)...
tr: Değiştir...
uk: Замінити...
vi: Thay thế...
zh_hans: 替换(H)...
zh_hant: 取代(H)...

# Menu_Search_Replace.AccessKey
source: H
ar: د
cs: A
de: E
el: Α
es: R
fa: ز
fr: E
hu: C
id: G
it: O
pl: A
pt: S
ro: N
ru: З
tr: D
uk: М

# Menu_Search_ClearHistory.Text
source: Clear Search History
ar: مسح سجل البحث
cs: Vymazat historii hledání
de: Suchverlauf löschen
el: Απαλοιφή ιστορικού αναζήτησης
es: Borrar el historial de búsqueda
fa: پاک کردن سابقهٔ جستجو
fr: Effacer l'historique de recherche
hu: Keresési előzmények törlése
id: Hapus Riwayat Pencarian
it: Cancella cronologia ricerche
ja: 検索履歴を消去(C)
ko: 검색 기록 지우기(C)
pl: Wyczyść historię wyszukiwania
pt: Limpar histórico de pesquisa
ro: Golire istoric căutare
ru: Очистить журнал поиска
th: ล้างประวัติการค้นหา(C)
tr: Arama Geçmişini Temizle
uk: Очистити журнал пошуку
vi: Xóa Lịch sử Tìm kiếm
zh_hans: 清除搜索历史记录(C)
zh_hant: 清除搜尋記錄(C)

# Menu_Search_ClearHistory.AccessKey
source: C
ar: م
cs: V
de: L
el: Λ
es: E
fa: پ
fr: L
hu: T
id: H
pl: W
pt: H
ro: I
ru: О
tr: T
uk: О
vi: X

# Find_Kind_Integer.Content
source: Integer
ar: عدد صحيح
cs: Celé číslo
de: Ganzzahl
el: Ακέραιος
es: Entero
fa: عدد صحیح
fr: Entier
hu: Egész szám
id: Bilangan bulat
it: Intero
ja: 整数
ko: 정수
pl: Liczba całkowita
pt: Inteiro
ro: Întreg
ru: Целое число
th: จำนวนเต็ม
tr: Tamsayı
uk: Ціле число
vi: Số nguyên
zh_hans: 整数
zh_hant: 整數

# Find_Kind_Float.Content
source: Floating point
ar: فاصلة عائمة
cs: Plovoucí čárka
de: Gleitkomma
el: Κινητή υποδιαστολή
es: Punto flotante
fa: ممیز شناور
fr: Virgule flottante
hu: Lebegőpontos
it: Virgola mobile
ja: 浮動小数点
ko: 부동 소수점
pl: Zmiennoprzecinkowa
pt: Ponto flutuante
ro: Virgulă mobilă
ru: С плавающей запятой
th: ทศนิยมลอยตัว
tr: Kayan nokta
uk: Число з рухомою комою
vi: Số thực dấu phẩy động
zh_hans: 浮点数
zh_hant: 浮點數

# Find_KindName_Text
source: Text
ar: نص
el: Κείμενο
es: Texto
fa: متن
fr: Texte
hu: Szöveg
id: Teks
it: Testo
ja: テキスト
ko: 텍스트
pl: Tekst
pt: Texto
ru: Текст
th: ข้อความ
tr: Metin
uk: Текст
vi: Văn bản
zh_hans: 文本
zh_hant: 文字

# Find_KindName_Integer
source: Integer
ar: عدد صحيح
cs: Celé číslo
de: Ganzzahl
el: Ακέραιος
es: Entero
fa: عدد صحیح
fr: Entier
hu: Egész szám
id: Bilangan bulat
it: Intero
ja: 整数
ko: 정수
pl: Liczba całkowita
pt: Inteiro
ro: Întreg
ru: Целое число
th: จำนวนเต็ม
tr: Tamsayı
uk: Ціле число
vi: Số nguyên
zh_hans: 整数
zh_hant: 整數

# Find_KindName_Float
source: Floating point
ar: فاصلة عائمة
cs: Plovoucí čárka
de: Gleitkomma
el: Κινητή υποδιαστολή
es: Punto flotante
fa: ممیز شناور
fr: Virgule flottante
hu: Lebegőpontos
it: Virgola mobile
ja: 浮動小数点
ko: 부동 소수점
pl: Zmiennoprzecinkowa
pt: Ponto flutuante
ro: Virgulă mobilă
ru: С плавающей запятой
th: ทศนิยมลอยตัว
tr: Kayan nokta
uk: Число з рухомою комою
vi: Số thực dấu phẩy động
zh_hans: 浮点数
zh_hant: 浮點數

# Find_HistoryEmpty.Text
source: No search history.
ar: لا يوجد سجل بحث.
cs: Žádná historie hledání.
de: Kein Suchverlauf.
el: Δεν υπάρχει ιστορικό αναζήτησης.
es: No hay historial de búsqueda.
fa: سابقهٔ جستجو وجود ندارد.
fr: Aucun historique de recherche.
hu: Nincsenek keresési előzmények.
id: Tidak ada riwayat pencarian.
it: Nessuna cronologia delle ricerche.
ja: 検索履歴はありません。
ko: 검색 기록이 없습니다.
pl: Brak historii wyszukiwania.
pt: Nenhum histórico de pesquisa.
ro: Niciun istoric de căutare.
ru: Журнал поиска пуст.
th: ไม่มีประวัติการค้นหา
tr: Arama geçmişi yok.
uk: Журнал пошуку порожній.
vi: Không có lịch sử tìm kiếm.
zh_hans: 没有搜索历史记录。
zh_hant: 沒有搜尋記錄。

# Find_History_Name
source: Search history
ar: سجل البحث
cs: Historie hledání
de: Suchverlauf
el: Ιστορικό αναζήτησης
es: Historial de búsqueda
fa: سابقهٔ جستجو
fr: Historique de recherche
hu: Keresési előzmények
id: Riwayat pencarian
it: Cronologia delle ricerche
ja: 検索履歴
ko: 검색 기록
pl: Historia wyszukiwania
pt: Histórico de pesquisa
ro: Istoric căutare
ru: Журнал поиска
th: ประวัติการค้นหา
tr: Arama geçmişi
uk: Журнал пошуку
vi: Lịch sử tìm kiếm
zh_hans: 搜索历史记录
zh_hant: 搜尋記錄

# Find_HistoryDelete_Name
source: Remove “{0}” from the history
ar: إزالة «{0}» من السجل
cs: Odebrat „{0}“ z historie
de: „{0}“ aus dem Verlauf entfernen
el: Κατάργηση του «{0}» από το ιστορικό
es: Quitar “{0}” del historial
fa: حذف «{0}» از سابقه
fr: Supprimer « {0} » de l'historique
hu: „{0}” eltávolítása az előzményekből
id: Hapus “{0}” dari riwayat
it: Rimuovi “{0}” dalla cronologia
ja: 「{0}」を履歴から削除
ko: 기록에서 “{0}” 제거
pl: Usuń „{0}” z historii
pt: Remover “{0}” do histórico
ro: Eliminare „{0}” din istoric
ru: Удалить «{0}» из журнала
th: ลบ “{0}” ออกจากประวัติ
tr: “{0}” öğesini geçmişten kaldır
uk: Видалити «{0}» із журналу
vi: Xóa “{0}” khỏi lịch sử
zh_hans: 从历史记录中删除“{0}”
zh_hant: 從記錄中移除「{0}」

# Find_HistoryDelete_Tip
source: Remove from the history
ar: إزالة من السجل
cs: Odebrat z historie
de: Aus dem Verlauf entfernen
el: Κατάργηση από το ιστορικό
es: Quitar del historial
fa: حذف از سابقه
fr: Supprimer de l'historique
hu: Eltávolítás az előzményekből
id: Hapus dari riwayat
it: Rimuovi dalla cronologia
ja: 履歴から削除
ko: 기록에서 제거
pl: Usuń z historii
pt: Remover do histórico
ro: Eliminare din istoric
ru: Удалить из журнала
th: ลบออกจากประวัติ
tr: Geçmişten kaldır
uk: Видалити з журналу
vi: Xóa khỏi lịch sử
zh_hans: 从历史记录中删除
zh_hant: 從記錄中移除

# Find_FindAll.Content
source: Find all
ar: البحث عن الكل
cs: Najít vše
de: Alle suchen
el: Εύρεση όλων
es: Buscar todo
fa: یافتن همه
fr: Tout rechercher
hu: Összes keresése
id: Temukan semua
it: Trova tutto
ja: すべて検索
ko: 모두 찾기
pl: Znajdź wszystko
pt: Localizar tudo
ro: Găsire toate
ru: Найти все
th: ค้นหาทั้งหมด
tr: Tümünü bul
uk: Знайти все
vi: Tìm tất cả
zh_hans: 全部查找
zh_hant: 全部尋找

# Find_FindAll_Name
source: Find all
ar: البحث عن الكل
cs: Najít vše
de: Alle suchen
el: Εύρεση όλων
es: Buscar todo
fa: یافتن همه
fr: Tout rechercher
hu: Összes keresése
id: Temukan semua
it: Trova tutto
ja: すべて検索
ko: 모두 찾기
pl: Znajdź wszystko
pt: Localizar tudo
ro: Găsire toate
ru: Найти все
th: ค้นหาทั้งหมด
tr: Tümünü bul
uk: Знайти все
vi: Tìm tất cả
zh_hans: 全部查找
zh_hant: 全部尋找

# Find_FoundCount
source: {0, plural, one {# match found.} other {# matches found.}}
ar: {0, plural, zero {لم يتم العثور على تطابقات.} one {تم العثور على تطابق واحد.} two {تم العثور على تطابقين.} few {تم العثور على # تطابقات.} many {تم العثور على # تطابقًا.} other {تم العثور على # تطابق.}}
cs: {0, plural, one {Nalezena # shoda.} few {Nalezeny # shody.} many {Nalezeno # shody.} other {Nalezeno # shod.}}
de: {0, plural, one {# Treffer gefunden.} other {# Treffer gefunden.}}
el: {0, plural, one {Βρέθηκε # αποτέλεσμα.} other {Βρέθηκαν # αποτελέσματα.}}
es: {0, plural, one {Se encontró # coincidencia.} other {Se encontraron # coincidencias.}}
fa: {0, plural, one {# مورد منطبق پیدا شد.} other {# مورد منطبق پیدا شد.}}
fr: {0, plural, one {# résultat trouvé.} other {# résultats trouvés.}}
hu: {0, plural, one {# találat.} other {# találat.}}
id: {0, plural, other {# kecocokan ditemukan.}}
it: {0, plural, one {# corrispondenza trovata.} other {# corrispondenze trovate.}}
ja: {0} 件見つかりました。
ko: {0, plural, other {일치 항목 #개를 찾았습니다.}}
pl: {0, plural, one {Znaleziono # dopasowanie.} few {Znaleziono # dopasowania.} many {Znaleziono # dopasowań.} other {Znaleziono # dopasowania.}}
pt: {0, plural, one {# ocorrência encontrada.} other {# ocorrências encontradas.}}
ro: {0, plural, one {S-a găsit # potrivire.} few {S-au găsit # potriviri.} other {S-au găsit # de potriviri.}}
ru: {0, plural, one {Найдено # совпадение.} few {Найдено # совпадения.} many {Найдено # совпадений.} other {Найдено # совпадения.}}
th: {0, plural, other {พบ # รายการ}}
tr: {0, plural, one {# eşleşme bulundu.} other {# eşleşme bulundu.}}
uk: {0, plural, one {Знайдено # збіг.} few {Знайдено # збіги.} many {Знайдено # збігів.} other {Знайдено # збігу.}}
vi: {0, plural, other {Đã tìm thấy # kết quả khớp.}}
zh_hans: {0, plural, other {已找到 # 个匹配项。}}
zh_hant: {0, plural, other {找到 # 個符合項目。}}

# Find_Scope_Range.Content
source: Offset range
ar: نطاق إزاحات
cs: Rozsah posunů
de: Offsetbereich
el: Περιοχή μετατοπίσεων
es: Intervalo de desplazamientos
fa: محدودهٔ آفست
fr: Plage de décalages
hu: Eltolástartomány
id: Rentang offset
it: Intervallo di offset
ja: オフセット範囲
ko: 오프셋 범위
pl: Zakres przesunięć
pt: Intervalo de deslocamentos
ro: Interval de deplasamente
ru: Диапазон смещений
th: ช่วงออฟเซ็ต
tr: Ofset aralığı
uk: Діапазон зміщень
vi: Phạm vi độ lệch
zh_hans: 偏移量范围
zh_hant: 位移範圍

# Find_RangeStart.PlaceholderText
source: Start (e.g. 0x100)
ar: البداية (مثل 0x100)
cs: Začátek (např. 0x100)
de: Anfang (z. B. 0x100)
el: Αρχή (π.χ. 0x100)
es: Inicio (p. ej., 0x100)
fa: شروع (مثلاً 0x100)
fr: Début (par ex. 0x100)
hu: Kezdet (pl. 0x100)
id: Awal (mis. 0x100)
it: Inizio (ad es. 0x100)
ja: 開始 (例: 0x100)
ko: 시작(예: 0x100)
pl: Początek (np. 0x100)
pt: Início (por exemplo, 0x100)
ro: Început (de ex. 0x100)
ru: Начало (например, 0x100)
th: เริ่มต้น (เช่น 0x100)
tr: Başlangıç (ör. 0x100)
uk: Початок (наприклад, 0x100)
vi: Đầu (ví dụ: 0x100)
zh_hans: 开始（例如 0x100）
zh_hant: 開始（例如 0x100）

# Find_RangeEnd.PlaceholderText
source: End, inclusive (e.g. end-0x10)
ar: النهاية، شاملة (مثل end-0x10)
cs: Konec, včetně (např. end-0x10)
de: Ende, einschließlich (z. B. end-0x10)
el: Τέλος, συμπεριλαμβάνεται (π.χ. end-0x10)
es: Fin, incluido (p. ej., end-0x10)
fa: پایان، شامل (مثلاً end-0x10)
fr: Fin, incluse (par ex. end-0x10)
hu: Vég, ezzel együtt (pl. end-0x10)
id: Akhir, inklusif (mis. end-0x10)
it: Fine, inclusa (ad es. end-0x10)
ja: 終了 (このバイトを含む。例: end-0x10)
ko: 끝, 이 바이트 포함(예: end-0x10)
pl: Koniec, włącznie (np. end-0x10)
pt: Fim, inclusivo (por exemplo, end-0x10)
ro: Sfârșit, inclusiv (de ex. end-0x10)
ru: Конец включительно (например, end-0x10)
th: สิ้นสุด รวมไบต์นี้ (เช่น end-0x10)
tr: Bitiş, dahil (ör. end-0x10)
uk: Кінець, включно (наприклад, end-0x10)
vi: Cuối, bao gồm (ví dụ: end-0x10)
zh_hans: 结束，含此字节（例如 end-0x10）
zh_hant: 結束，含（例如 end-0x10）

# Find_RangeInfo
source: {0} ({1}) to {2} ({3})
ar: {0} ({1}) إلى {2} ({3})
cs: {0} ({1}) až {2} ({3})
de: {0} ({1}) bis {2} ({3})
el: {0} ({1}) έως {2} ({3})
es: {0} ({1}) a {2} ({3})
fa: {0} ({1}) تا {2} ({3})
fr: {0} ({1}) à {2} ({3})
id: {0} ({1}) hingga {2} ({3})
it: Da {0} ({1}) a {2} ({3})
pl: Od {0} ({1}) do {2} ({3})
pt: {0} ({1}) a {2} ({3})
ru: С {0} ({1}) по {2} ({3})
th: {0} ({1}) ถึง {2} ({3})
uk: Від {0} ({1}) до {2} ({3})
vi: {0} ({1}) đến {2} ({3})
zh_hans: {0}（{1}）到 {2}（{3}）
zh_hant: {0}（{1}）到 {2}（{3}）

# Find_RangeInvalid
source: The range is invalid: the start must not be after the end, and both must be inside the document.
ar: النطاق غير صالح: يجب ألا تكون البداية بعد النهاية، ويجب أن تكون كلتاهما داخل المستند.
cs: Rozsah je neplatný: začátek nesmí být za koncem a oba musí ležet uvnitř dokumentu.
de: Der Bereich ist ungültig: Der Anfang darf nicht nach dem Ende liegen, und beide müssen innerhalb des Dokuments liegen.
el: Η περιοχή δεν είναι έγκυρη: η αρχή δεν πρέπει να είναι μετά το τέλος και και τα δύο πρέπει να βρίσκονται μέσα στο έγγραφο.
es: El intervalo no es válido: el inicio no puede estar después del fin y ambos deben estar dentro del documento.
fa: محدوده نامعتبر است: شروع نباید پس از پایان باشد و هر دو باید درون سند باشند.
fr: La plage n'est pas valide : le début ne doit pas suivre la fin, et les deux doivent se trouver dans le document.
hu: A tartomány érvénytelen: a kezdet nem lehet a vég után, és mindkettőnek a dokumentumon belül kell lennie.
id: Rentang tidak valid: awal tidak boleh setelah akhir, dan keduanya harus berada di dalam dokumen.
it: L'intervallo non è valido: l'inizio non deve essere successivo alla fine ed entrambi devono trovarsi all'interno del documento.
ja: 範囲が正しくありません。開始は終了より後にできず、どちらもドキュメントの中にある必要があります。
ko: 범위가 올바르지 않습니다. 시작은 끝보다 뒤에 있을 수 없으며 둘 다 문서 안에 있어야 합니다.
pl: Zakres jest nieprawidłowy: początek nie może być za końcem, a oba muszą mieścić się w dokumencie.
pt: O intervalo é inválido: o início não pode estar após o fim, e ambos devem estar dentro do documento.
ro: Intervalul nu este valid: începutul nu poate fi după sfârșit și ambele trebuie să se afle în interiorul documentului.
ru: Недопустимый диапазон: начало не должно быть после конца, и оба значения должны находиться в пределах документа.
th: ช่วงไม่ถูกต้อง: จุดเริ่มต้นต้องไม่อยู่หลังจุดสิ้นสุด และทั้งสองต้องอยู่ภายในเอกสาร
tr: Aralık geçersiz: başlangıç bitişten sonra olmamalı ve ikisi de belgenin içinde olmalıdır.
uk: Неприпустимий діапазон: початок не може бути після кінця, і обидва мають бути в межах документа.
vi: Phạm vi không hợp lệ: đầu không được nằm sau cuối và cả hai phải nằm trong tài liệu.
zh_hans: 范围无效：开始不能晚于结束，并且两者都必须位于文档内。
zh_hant: 範圍無效：開始位置不可在結束位置之後，且兩者都必須在文件內。

# Find_WholeWord.Content
source: Whole words only
ar: الكلمات الكاملة فقط
cs: Jen celá slova
de: Nur ganze Wörter
el: Μόνο ολόκληρες λέξεις
es: Solo palabras completas
fa: فقط کل واژه‌ها
fr: Mots entiers uniquement
hu: Csak teljes szavak
id: Hanya kata utuh
it: Solo parole intere
ja: 単語単位で探す
ko: 단어 단위로
pl: Tylko całe wyrazy
pt: Somente palavras inteiras
ro: Doar cuvinte întregi
ru: Только слово целиком
th: ทั้งคำเท่านั้น
tr: Yalnızca tam sözcükler
uk: Лише слово повністю
vi: Chỉ khớp toàn bộ từ
zh_hans: 全字匹配
zh_hant: 全字拼寫須相符

# Find_IntBits_Item
source: {0} bit
ar: {0} بت
cs: {0} bitů
es: {0} bits
fa: {0} بیت
fr: {0} bits
ko: {0}비트
pl: {0}-bitowa
pt: {0} bits
ro: {0} biți
ru: {0} бит
th: {0} บิต
uk: {0} біт
zh_hans: {0} 位
zh_hant: {0} 位元

# Find_IntBits_Name
source: Integer size
ar: حجم العدد الصحيح
cs: Velikost celého čísla
de: Ganzzahlgröße
el: Μέγεθος ακεραίου
es: Tamaño del entero
fa: اندازهٔ عدد صحیح
fr: Taille de l'entier
hu: Egész szám mérete
id: Ukuran bilangan bulat
it: Dimensione dell'intero
ja: 整数のサイズ
ko: 정수 크기
pl: Rozmiar liczby całkowitej
pt: Tamanho do inteiro
ro: Dimensiune întreg
ru: Размер целого числа
th: ขนาดจำนวนเต็ม
tr: Tamsayı boyutu
uk: Розмір цілого числа
vi: Kích thước số nguyên
zh_hans: 整数大小
zh_hant: 整數大小

# Find_Sign_Name
source: Sign
ar: الإشارة
cs: Znaménko
de: Vorzeichen
el: Πρόσημο
es: Signo
fa: علامت
fr: Signe
hu: Előjel
id: Tanda
it: Segno
ja: 符号
ko: 부호
pl: Znak
pt: Sinal
ro: Semn
ru: Знак
th: เครื่องหมาย
tr: İşaret
uk: Знак
vi: Dấu
zh_hans: 符号
zh_hant: 正負號

# Find_Sign_Either.Content
source: Signed or unsigned
ar: بإشارة أو بدون إشارة
cs: Se znaménkem i bez
de: Mit oder ohne Vorzeichen
el: Προσημασμένος ή μη προσημασμένος
es: Con o sin signo
fa: علامت‌دار یا بدون علامت
fr: Signé ou non signé
hu: Előjeles vagy előjel nélküli
id: Bertanda atau tidak bertanda
it: Con o senza segno
ja: どちらでも
ko: 부호 있음 또는 없음
pl: Ze znakiem lub bez
pt: Com ou sem sinal
ro: Cu sau fără semn
ru: Со знаком или без знака
th: มีหรือไม่มีเครื่องหมาย
tr: İşaretli veya işaretsiz
uk: Зі знаком або без знака
vi: Có dấu hoặc không dấu
zh_hans: 有符号或无符号
zh_hant: 帶正負號或不帶正負號

# Find_Sign_Signed.Content
source: Signed
ar: بإشارة
cs: Se znaménkem
de: Mit Vorzeichen
el: Προσημασμένος
es: Con signo
fa: علامت‌دار
fr: Signé
hu: Előjeles
id: Bertanda
it: Con segno
ja: 符号あり
ko: 부호 있음
pl: Ze znakiem
pt: Com sinal
ro: Cu semn
ru: Со знаком
th: มีเครื่องหมาย
tr: İşaretli
uk: Зі знаком
vi: Có dấu
zh_hans: 有符号
zh_hant: 帶正負號

# Find_Sign_Unsigned.Content
source: Unsigned
ar: بدون إشارة
cs: Bez znaménka
de: Ohne Vorzeichen
el: Μη προσημασμένος
es: Sin signo
fa: بدون علامت
fr: Non signé
hu: Előjel nélküli
id: Tidak bertanda
it: Senza segno
ja: 符号なし
ko: 부호 없음
pl: Bez znaku
pt: Sem sinal
ro: Fără semn
ru: Без знака
th: ไม่มีเครื่องหมาย
tr: İşaretsiz
uk: Без знака
vi: Không dấu
zh_hans: 无符号
zh_hant: 不帶正負號

# Find_FloatFormat_Name
source: Floating-point format
ar: تنسيق الفاصلة العائمة
cs: Formát s plovoucí čárkou
de: Gleitkommaformat
el: Μορφή κινητής υποδιαστολής
es: Formato de punto flotante
fa: قالب ممیز شناور
fr: Format à virgule flottante
hu: Lebegőpontos formátum
id: Format floating-point
it: Formato a virgola mobile
ja: 浮動小数点の形式
ko: 부동 소수점 형식
pl: Format zmiennoprzecinkowy
pt: Formato de ponto flutuante
ro: Format virgulă mobilă
ru: Формат чисел с плавающей запятой
th: รูปแบบทศนิยมลอยตัว
tr: Kayan nokta biçimi
uk: Формат числа з рухомою комою
vi: Định dạng số thực dấu phẩy động
zh_hans: 浮点格式
zh_hant: 浮點數格式

# Find_Float_Half.Content
source: half (16 bit)
ar: half (16 بت)
cs: half (16 bitů)
es: half (16 bits)
fa: half (16 بیت)
fr: half (16 bits)
ko: half(16비트)
pl: half (16 bitów)
pt: half (16 bits)
ro: half (16 biți)
ru: half (16 бит)
th: half (16 บิต)
uk: half (16 біт)
zh_hans: half（16 位）
zh_hant: half（16 位元）

# Find_Float_Single.Content
source: float (32 bit)
ar: float (32 بت)
cs: float (32 bitů)
es: float (32 bits)
fa: float (32 بیت)
fr: float (32 bits)
ko: float(32비트)
pl: float (32 bity)
pt: float (32 bits)
ro: float (32 de biți)
ru: float (32 бита)
th: float (32 บิต)
uk: float (32 біти)
zh_hans: float（32 位）
zh_hant: float（32 位元）

# Find_Float_Double.Content
source: double (64 bit)
ar: double (64 بت)
cs: double (64 bitů)
es: double (64 bits)
fa: double (64 بیت)
fr: double (64 bits)
ko: double(64비트)
pl: double (64 bity)
pt: double (64 bits)
ro: double (64 de biți)
ru: double (64 бита)
th: double (64 บิต)
uk: double (64 біти)
zh_hans: double（64 位）
zh_hant: double（64 位元）

# Find_Endian_Name
source: Byte order
ar: ترتيب البايتات
cs: Pořadí bajtů
de: Bytereihenfolge
el: Σειρά byte
es: Orden de bytes
fa: ترتیب بایت
fr: Ordre des octets
hu: Bájtsorrend
id: Urutan byte
it: Ordine dei byte
ja: エンディアン
ko: 바이트 순서
pl: Kolejność bajtów
pt: Ordem dos bytes
ro: Ordinea octeților
ru: Порядок байтов
th: ลำดับไบต์
tr: Bayt sırası
uk: Порядок байтів
vi: Thứ tự byte
zh_hans: 字节顺序
zh_hant: 位元組順序

# Find_Endian_Both.Content
source: Both
ar: كلاهما
cs: Obojí
de: Beide
el: Και τα δύο
es: Ambos
fa: هر دو
fr: Les deux
hu: Mindkettő
id: Keduanya
it: Entrambi
ja: 両方
ko: 둘 다
pl: Obie
pt: Ambos
ro: Ambele
ru: Оба
th: ทั้งสองแบบ
tr: Her ikisi
uk: Обидва
vi: Cả hai
zh_hans: 两者
zh_hant: 兩者

# Find_Tolerance_Name
source: Tolerance
ar: التفاوت المسموح
de: Toleranz
el: Ανοχή
es: Tolerancia
fa: رواداری
fr: Tolérance
hu: Tűrés
id: Toleransi
it: Tolleranza
ja: 許容誤差
ko: 허용 오차
pl: Tolerancja
pt: Tolerância
ro: Toleranță
ru: Погрешность
th: ค่าความคลาดเคลื่อน
tr: Tolerans
uk: Допуск
vi: Dung sai
zh_hans: 容差
zh_hant: 容許誤差

# Find_Tolerance_None.Content
source: Exact
ar: مطابق تماماً
cs: Přesně
de: Exakt
el: Ακριβής
es: Exacta
fa: دقیق
fr: Exacte
hu: Pontos
id: Persis
it: Esatto
ja: 誤差なし
ko: 정확히 일치
pl: Dokładnie
pt: Exato
ru: Точно
th: ตรงทุกประการ
tr: Tam
uk: Точно
vi: Chính xác
zh_hans: 精确
zh_hant: 完全相符

# Find_Tolerance_Absolute.Content
source: Absolute tolerance
ar: تفاوت مطلق
cs: Absolutní tolerance
de: Absolute Toleranz
el: Απόλυτη ανοχή
es: Tolerancia absoluta
fa: رواداری مطلق
fr: Tolérance absolue
hu: Abszolút tűrés
id: Toleransi absolut
it: Tolleranza assoluta
ja: 絶対誤差
ko: 절대 허용 오차
pl: Tolerancja bezwzględna
pt: Tolerância absoluta
ro: Toleranță absolută
ru: Абсолютная погрешность
th: ความคลาดเคลื่อนสัมบูรณ์
tr: Mutlak tolerans
uk: Абсолютний допуск
vi: Dung sai tuyệt đối
zh_hans: 绝对容差
zh_hant: 絕對誤差

# Find_Tolerance_Relative.Content
source: Relative tolerance
ar: تفاوت نسبي
cs: Relativní tolerance
de: Relative Toleranz
el: Σχετική ανοχή
es: Tolerancia relativa
fa: رواداری نسبی
fr: Tolérance relative
hu: Relatív tűrés
id: Toleransi relatif
it: Tolleranza relativa
ja: 相対誤差
ko: 상대 허용 오차
pl: Tolerancja względna
pt: Tolerância relativa
ro: Toleranță relativă
ru: Относительная погрешность
th: ความคลาดเคลื่อนสัมพัทธ์
tr: Göreli tolerans
uk: Відносний допуск
vi: Dung sai tương đối
zh_hans: 相对容差
zh_hant: 相對誤差

# Find_ToleranceValue.PlaceholderText
source: Tolerance (e.g. 0.001)
ar: التفاوت (مثل 0.001)
cs: Tolerance (např. 0.001)
de: Toleranz (z. B. 0.001)
el: Ανοχή (π.χ. 0.001)
es: Tolerancia (p. ej., 0.001)
fa: رواداری (مثلاً 0.001)
fr: Tolérance (par ex. 0.001)
hu: Tűrés (pl. 0.001)
id: Toleransi (mis. 0.001)
it: Tolleranza (ad es. 0.001)
ja: 誤差 (例: 0.001)
ko: 허용 오차(예: 0.001)
pl: Tolerancja (np. 0.001)
pt: Tolerância (por exemplo, 0.001)
ro: Toleranță (de ex. 0.001)
ru: Погрешность (например, 0.001)
th: ค่าความคลาดเคลื่อน (เช่น 0.001)
tr: Tolerans (ör. 0.001)
uk: Допуск (наприклад, 0.001)
vi: Dung sai (ví dụ: 0.001)
zh_hans: 容差（例如 0.001）
zh_hant: 容許誤差（例如 0.001）

# Find_FloatStored
source: Stored as {0}: {1} = {2}
ar: مخزّنة كـ {0}: {1} = {2}
cs: Uloženo jako {0}: {1} = {2}
de: Gespeichert als {0}: {1} = {2}
el: Αποθηκεύεται ως {0}: {1} = {2}
es: Almacenado como {0}: {1} = {2}
fa: ذخیره‌شده به‌صورت {0}: {1} = {2}
fr: Stocké en {0} : {1} = {2}
hu: Tárolás {0} formában: {1} = {2}
id: Disimpan sebagai {0}: {1} = {2}
it: Memorizzato come {0}: {1} = {2}
ja: {0} として格納される値: {1} = {2}
ko: {0}(으)로 저장되는 값: {1} = {2}
pl: Zapisane jako {0}: {1} = {2}
pt: Armazenado como {0}: {1} = {2}
ro: Stocat ca {0}: {1} = {2}
ru: Хранится как {0}: {1} = {2}
th: จัดเก็บเป็น {0}: {1} = {2}
tr: {0} olarak saklanır: {1} = {2}
uk: Зберігається як {0}: {1} = {2}
vi: Được lưu dưới dạng {0}: {1} = {2}
zh_hans: 存储为 {0}：{1} = {2}
zh_hant: 儲存為 {0}：{1} = {2}
